# DDL: CREATE, ALTER, DROP, TRUNCATE
Explanation:
- The code snippet demonstrates the use of Data Definition Language (DDL) statements in SQL to create, alter, drop, and truncate a table.
- The `CREATE TABLE` statement is used to create a new table named "employees" with columns for id, name, age, and salary.
- The `ALTER TABLE` statement is used to add a new column "department" to the "employees" table using the `ADD COLUMN` clause.
- The `ALTER TABLE` statement is also used to modify the data type of the "age" column to SMALLINT using the `ALTER COLUMN` clause.
- The `DROP COLUMN` clause is used with the `ALTER TABLE` statement to remove the "department" column from the "employees" table.
- The `TRUNCATE TABLE` statement is used to remove all data from the "employees" table.
- Finally, the `DESCRIBE` statement is used to print the structure of the "employees" table.

Expected output:
```
+--------+-------------+------+-----+---------+-------+
| Field  | Type        | Null | Key | Default | Extra |
+--------+-------------+------+-----+---------+-------+
| id     | int         | NO   | PRI | NULL    |       |
| name   | varchar(50) | YES  |     | NULL    |       |
| age    | smallint    | YES  |     | NULL    |       |
| salary | decimal(10,2) | YES |     | NULL    |       |
+--------+-------------+------+-----+---------+-------+
```

In [ ]:
-- Create a new table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Alter the table to add a new column
ALTER TABLE employees
ADD COLUMN department VARCHAR(50);

-- Alter the table to modify the data type of a column
ALTER TABLE employees
ALTER COLUMN age SET DATA TYPE SMALLINT;

-- Drop the department column from the table
ALTER TABLE employees
DROP COLUMN department;

-- Truncate the table to remove all data
TRUNCATE TABLE employees;

-- Print the table structure
DESCRIBE employees;

# DML: SELECT, INSERT, UPDATE, DELETE
Summary:
This code snippet demonstrates the Data Manipulation Language (DML) operations in SQL, specifically SELECT, INSERT, UPDATE, and DELETE. 

- The `CREATE TABLE` statement is used to create a table called "employees" with columns for id, name, age, and salary.
- The `INSERT INTO` statement is used to insert multiple rows of data into the "employees" table.
- The `SELECT` statement is used to retrieve data from the "employees" table. It demonstrates selecting all rows, selecting specific columns, selecting rows based on conditions, ordering the results, and limiting the number of results.
- The `UPDATE` statement is used to modify the salary of an employee with a specific id.
- The `DELETE` statement is used to remove an employee from the table based on their id.

These operations are fundamental for manipulating data in SQL databases.

In [ ]:
-- Create a table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000.00),
       (2, 'Jane Smith', 25, 45000.00),
       (3, 'Mike Johnson', 35, 60000.00);

-- Select all rows from the table
SELECT * FROM employees;
-- Expected output:
-- id |     name      | age |  salary
-- ----+---------------+-----+----------
--  1  |   John Doe    |  30 | 50000.00
--  2  |  Jane Smith   |  25 | 45000.00
--  3  | Mike Johnson  |  35 | 60000.00

-- Select specific columns from the table
SELECT name, salary FROM employees;
-- Expected output:
--     name      |  salary
-- --------------+----------
--   John Doe    | 50000.00
--  Jane Smith   | 45000.00
-- Mike Johnson  | 60000.00

-- Update a row in the table
UPDATE employees
SET salary = 55000.00
WHERE id = 1;

-- Delete a row from the table
DELETE FROM employees
WHERE id = 2;

-- Select rows based on conditions
SELECT * FROM employees
WHERE age > 30;
-- Expected output:
-- id |     name      | age |  salary
-- ----+---------------+-----+----------
--  3  | Mike Johnson  |  35 | 60000.00

-- Select rows and order the results
SELECT * FROM employees
ORDER BY salary DESC;
-- Expected output:
-- id |     name      | age |  salary
-- ----+---------------+-----+----------
--  3  | Mike Johnson  |  35 | 60000.00
--  1  |   John Doe    |  30 | 55000.00

-- Select rows and limit the number of results
SELECT * FROM employees
LIMIT 2;
-- Expected output:
-- id |     name      | age |  salary
-- ----+---------------+-----+----------
--  3  | Mike Johnson  |  35 | 60000.00
--  1  |   John Doe    |  30 | 55000.00